Sysbench_PolarDB_Mysql5.7-8.0/Sysbench_Mysql5.7_log/32Core256G-1Node/202103101547/sysbench_read_write_2500.log
Time: 20210310155837, now running sysbench with thread of:  + 2500
Running command: sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --mysql-host=pc-0iwy9d23001p89dal.rwlb.japan.rds.aliyuncs.com --mysql-port=3306 --mysql-user=sbtest --mysql-password=Test1234 --mysql-db=sbtest --table-size=100000000 --tables=500 --events=0 --time=60 --db-ps-mode=disable --percentile=95 --report-interval=1 --threads=2500 run
sysbench 1.0.18-ab7d582 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2500
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 2500 tps: 3820.64 qps: 114989.41 (r/w/o: 86071.08/18928.48/9989.85) lat (ms,95%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 2500 tps: 4550.25 qps: 90226.98 (r/w/o: 63235.29/17890.20/9101.49) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 2500 tps: 4420.66 qps: 89241.75 (r/w/o: 62558.72/17842.71/8840.31) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 2500 tps: 2867.80 qps: 57533.03 (r/w/o: 40255.22/11542.20/5735.60) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 2500 tps: 2653.80 qps: 52579.04 (r/w/o: 36598.25/10672.20/5308.60) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 2500 tps: 2746.97 qps: 55366.37 (r/w/o: 39003.55/10869.88/5492.94) lat (ms,95%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 2500 tps: 2557.02 qps: 51142.39 (r/w/o: 35809.27/10219.08/5114.04) lat (ms,95%): 3706.08 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 2500 tps: 2822.14 qps: 56354.79 (r/w/o: 39290.95/11425.57/5638.28) lat (ms,95%): 3982.86 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 2500 tps: 2626.03 qps: 52352.64 (r/w/o: 36709.45/10389.13/5254.06) lat (ms,95%): 3574.99 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2500 tps: 4569.05 qps: 91284.95 (r/w/o: 63798.66/18350.19/9136.10) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 2500 tps: 2211.11 qps: 44617.32 (r/w/o: 31365.63/8824.46/4427.23) lat (ms,95%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 2500 tps: 1949.89 qps: 38995.77 (r/w/o: 27278.44/7816.55/3900.78) lat (ms,95%): 4128.91 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 2500 tps: 1862.96 qps: 37143.21 (r/w/o: 26001.44/7415.84/3725.92) lat (ms,95%): 4768.67 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 2500 tps: 1943.12 qps: 38984.46 (r/w/o: 27316.72/7781.49/3886.25) lat (ms,95%): 5217.92 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2500 tps: 1996.89 qps: 39891.74 (r/w/o: 27900.42/7997.55/3993.77) lat (ms,95%): 5607.61 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 2500 tps: 2008.93 qps: 40237.60 (r/w/o: 28214.02/8005.72/4017.86) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 2500 tps: 2299.31 qps: 45756.17 (r/w/o: 31984.31/9174.24/4597.62) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 2500 tps: 2220.83 qps: 44525.54 (r/w/o: 31239.57/8844.31/4441.65) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 2500 tps: 1663.09 qps: 33178.79 (r/w/o: 23181.25/6670.36/3327.18) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2500 tps: 1915.97 qps: 38353.35 (r/w/o: 26893.54/7627.87/3831.94) lat (ms,95%): 8333.38 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 2500 tps: 2104.78 qps: 42118.52 (r/w/o: 29481.86/8427.10/4209.55) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 2500 tps: 2066.16 qps: 40745.14 (r/w/o: 28454.19/8164.63/4126.32) lat (ms,95%): 8333.38 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 2500 tps: 1984.02 qps: 40208.31 (r/w/o: 28156.22/8078.06/3974.03) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 2500 tps: 2495.90 qps: 50008.05 (r/w/o: 35059.63/9956.61/4991.81) lat (ms,95%): 7895.16 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2500 tps: 2036.98 qps: 40699.65 (r/w/o: 28563.75/8061.93/4073.96) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 2500 tps: 1962.13 qps: 39296.54 (r/w/o: 27414.77/7957.51/3924.25) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 2500 tps: 1852.99 qps: 37106.85 (r/w/o: 25947.90/7452.97/3705.99) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 2500 tps: 2378.79 qps: 47722.83 (r/w/o: 33350.09/9615.16/4757.58) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 2500 tps: 1860.07 qps: 37163.31 (r/w/o: 26022.91/7420.26/3720.13) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2500 tps: 2023.11 qps: 40398.20 (r/w/o: 28317.54/8034.44/4046.22) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 2500 tps: 1754.89 qps: 35149.83 (r/w/o: 24598.48/7041.57/3509.78) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 2500 tps: 2372.07 qps: 47248.32 (r/w/o: 33086.92/9417.26/4744.13) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 2500 tps: 1990.14 qps: 39822.86 (r/w/o: 27903.00/7939.57/3980.29) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 2500 tps: 1966.85 qps: 39302.92 (r/w/o: 27524.84/7845.39/3932.69) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2500 tps: 1740.04 qps: 34853.74 (r/w/o: 24320.52/7052.15/3481.07) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 2500 tps: 2113.07 qps: 42267.36 (r/w/o: 29573.95/8468.27/4225.14) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 2500 tps: 1976.03 qps: 39599.67 (r/w/o: 27718.47/7928.13/3953.07) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 2500 tps: 2478.81 qps: 49536.28 (r/w/o: 34740.39/9838.26/4957.63) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 2500 tps: 1992.01 qps: 39850.21 (r/w/o: 27885.15/7981.04/3984.02) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2500 tps: 2515.04 qps: 50059.87 (r/w/o: 34970.61/10060.17/5029.09) lat (ms,95%): 8955.74 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 2500 tps: 1900.97 qps: 38089.43 (r/w/o: 26687.60/7599.89/3801.94) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 2500 tps: 2253.23 qps: 44958.61 (r/w/o: 31472.23/8980.92/4505.46) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 2500 tps: 1827.84 qps: 36357.80 (r/w/o: 25405.76/7301.36/3650.68) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 2500 tps: 2055.14 qps: 41328.78 (r/w/o: 29029.95/8181.55/4117.28) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2500 tps: 2223.81 qps: 44534.23 (r/w/o: 31122.36/8964.24/4447.62) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 2500 tps: 1706.02 qps: 34304.34 (r/w/o: 23993.24/6899.07/3412.03) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 2500 tps: 1769.87 qps: 35399.43 (r/w/o: 24839.20/7020.49/3539.74) lat (ms,95%): 7895.16 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 2500 tps: 2048.17 qps: 41012.43 (r/w/o: 28710.40/8205.69/4096.34) lat (ms,95%): 8038.61 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 2500 tps: 1885.00 qps: 37398.01 (r/w/o: 26066.01/7563.00/3769.00) lat (ms,95%): 8038.61 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2500 tps: 1933.92 qps: 38649.39 (r/w/o: 27119.87/7662.68/3866.84) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 2500 tps: 2390.05 qps: 47751.09 (r/w/o: 33364.76/9604.22/4782.11) lat (ms,95%): 8038.61 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 2500 tps: 2260.08 qps: 45155.52 (r/w/o: 31570.06/9065.30/4520.15) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 2500 tps: 2044.85 qps: 41016.08 (r/w/o: 28727.95/8201.42/4086.71) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 2500 tps: 2324.08 qps: 46667.59 (r/w/o: 32664.11/9353.32/4650.16) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2500 tps: 2302.04 qps: 46074.81 (r/w/o: 32304.57/9165.16/4605.08) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 2500 tps: 2138.04 qps: 42758.75 (r/w/o: 29973.52/8509.15/4276.07) lat (ms,95%): 6135.91 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 2500 tps: 2175.97 qps: 43580.37 (r/w/o: 30563.56/8664.87/4351.94) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 2500 tps: 2128.96 qps: 42282.19 (r/w/o: 29513.43/8510.84/4257.92) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 2500 tps: 1996.05 qps: 39680.95 (r/w/o: 27746.67/7947.19/3987.10) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2500 tps: 2000.00 qps: 40319.00 (r/w/o: 28236.00/8080.00/4003.00) lat (ms,95%): 7895.16 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 2500 tps: 2115.02 qps: 42443.47 (r/w/o: 29783.33/8429.09/4231.05) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 2500 tps: 2107.97 qps: 42043.38 (r/w/o: 29415.56/8410.88/4216.94) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 2500 tps: 1883.02 qps: 37761.41 (r/w/o: 26561.29/7434.08/3766.04) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 2500 tps: 1964.01 qps: 39259.17 (r/w/o: 27431.12/7903.03/3925.02) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 2500 tps: 2148.89 qps: 42908.82 (r/w/o: 30096.47/8511.57/4300.78) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 2500 tps: 2574.23 qps: 51288.66 (r/w/o: 35886.26/10253.93/5148.47) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 2500 tps: 2128.77 qps: 42858.33 (r/w/o: 30009.73/8591.06/4257.54) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 2500 tps: 2152.12 qps: 42922.48 (r/w/o: 30067.74/8550.49/4304.25) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 2500 tps: 1833.98 qps: 36548.60 (r/w/o: 25501.72/7383.92/3662.96) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 2500 tps: 2137.89 qps: 42930.75 (r/w/o: 30093.43/8556.55/4280.78) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 2500 tps: 2068.12 qps: 41291.35 (r/w/o: 28829.64/8326.47/4135.24) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 2500 tps: 2501.06 qps: 50015.12 (r/w/o: 34993.79/10023.23/4998.11) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 2500 tps: 2204.53 qps: 44232.23 (r/w/o: 31076.93/8741.26/4414.04) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 2500 tps: 2315.66 qps: 46254.03 (r/w/o: 32410.18/9212.53/4631.31) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 2500 tps: 2217.17 qps: 44276.36 (r/w/o: 30949.35/8892.68/4434.34) lat (ms,95%): 5607.61 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 2500 tps: 1866.00 qps: 37418.95 (r/w/o: 26216.96/7469.99/3731.99) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 2500 tps: 2022.78 qps: 39946.63 (r/w/o: 27842.96/8058.12/4045.56) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 2500 tps: 2434.06 qps: 49120.22 (r/w/o: 34535.86/9716.24/4868.12) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 2500 tps: 1683.90 qps: 33726.90 (r/w/o: 23593.53/6765.58/3367.79) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 2500 tps: 2292.98 qps: 45626.56 (r/w/o: 31835.69/9208.91/4581.96) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 2500 tps: 1921.31 qps: 38615.19 (r/w/o: 27077.34/7694.23/3843.62) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 2500 tps: 1782.89 qps: 35501.86 (r/w/o: 24887.50/7045.57/3568.78) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 2500 tps: 2075.92 qps: 41622.32 (r/w/o: 29157.83/8312.67/4151.83) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 2500 tps: 2389.08 qps: 47779.52 (r/w/o: 33397.06/9604.31/4778.15) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 2500 tps: 2479.94 qps: 49706.82 (r/w/o: 34785.17/9961.76/4959.88) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 2500 tps: 1985.97 qps: 39721.44 (r/w/o: 27833.61/7915.89/3971.94) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 2500 tps: 1974.09 qps: 39308.84 (r/w/o: 27477.29/7883.37/3948.18) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 2500 tps: 2512.95 qps: 50181.04 (r/w/o: 35159.32/10001.81/5019.90) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 2500 tps: 2164.70 qps: 43546.90 (r/w/o: 30508.73/8702.78/4335.39) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 2500 tps: 2086.32 qps: 41398.45 (r/w/o: 28921.50/8307.29/4169.65) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 2500 tps: 1952.85 qps: 39053.10 (r/w/o: 27309.97/7834.42/3908.71) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 2500 tps: 1902.17 qps: 38486.49 (r/w/o: 26940.45/7741.70/3804.35) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 2500 tps: 1926.45 qps: 38445.88 (r/w/o: 26793.53/7800.41/3851.95) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 2500 tps: 2484.12 qps: 49454.90 (r/w/o: 34561.70/9930.20/4963.00) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 2500 tps: 1838.25 qps: 36985.96 (r/w/o: 25918.48/7382.99/3684.49) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 2500 tps: 2020.90 qps: 40552.91 (r/w/o: 28466.53/8046.59/4039.79) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 2500 tps: 2052.00 qps: 41031.00 (r/w/o: 28743.00/8184.00/4104.00) lat (ms,95%): 7895.16 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 2500 tps: 2565.18 qps: 51111.57 (r/w/o: 35771.50/10208.71/5131.36) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 2500 tps: 2007.91 qps: 39961.21 (r/w/o: 27918.75/8027.64/4014.82) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 2500 tps: 2720.06 qps: 54725.15 (r/w/o: 38327.80/10957.23/5440.11) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 2500 tps: 2074.95 qps: 41192.03 (r/w/o: 28800.32/8244.81/4146.90) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 2500 tps: 2218.06 qps: 44734.18 (r/w/o: 31418.83/8876.23/4439.12) lat (ms,95%): 7215.39 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 2500 tps: 2188.89 qps: 43568.79 (r/w/o: 30580.45/8610.56/4377.78) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 2500 tps: 2291.20 qps: 45805.93 (r/w/o: 31989.75/9237.79/4578.39) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 2500 tps: 1771.86 qps: 35502.24 (r/w/o: 24933.06/7021.45/3547.72) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 2500 tps: 2000.91 qps: 40070.28 (r/w/o: 27973.80/8094.65/4001.83) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 2500 tps: 2418.00 qps: 48412.10 (r/w/o: 33845.07/9734.02/4833.01) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 2500 tps: 2123.07 qps: 42629.50 (r/w/o: 29797.05/8583.30/4249.15) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 2500 tps: 2491.04 qps: 49680.82 (r/w/o: 34812.57/9886.16/4982.08) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 2500 tps: 2111.04 qps: 42116.79 (r/w/o: 29480.55/8415.16/4221.08) lat (ms,95%): 7479.98 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 2500 tps: 2031.99 qps: 40794.81 (r/w/o: 28569.87/8159.96/4064.98) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 2500 tps: 2368.16 qps: 47280.22 (r/w/o: 33066.25/9477.65/4736.32) lat (ms,95%): 6835.96 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 2500 tps: 2470.93 qps: 49406.53 (r/w/o: 34629.97/9834.71/4941.85) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 2500 tps: 2302.88 qps: 46022.65 (r/w/o: 32258.35/9158.53/4605.77) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 2500 tps: 2144.08 qps: 42555.59 (r/w/o: 29752.11/8515.32/4288.16) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 2500 tps: 2406.98 qps: 48430.57 (r/w/o: 33911.70/9701.91/4816.96) lat (ms,95%): 6594.16 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 2500 tps: 2201.93 qps: 44069.53 (r/w/o: 30888.97/8779.71/4400.85) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 2500 tps: 2116.19 qps: 42250.77 (r/w/o: 29525.64/8493.76/4231.38) lat (ms,95%): 6247.39 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 2500 tps: 2116.88 qps: 42236.57 (r/w/o: 29538.30/8466.51/4231.76) lat (ms,95%): 6476.48 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 2500 tps: 2688.69 qps: 52792.59 (r/w/o: 36705.25/10790.57/5296.77) lat (ms,95%): 8038.61 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 2500 tps: 710.99 qps: 2576.82 (r/w/o: 0.00/1858.81/718.01) lat (ms,95%): 10722.67 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 2500 tps: 726.21 qps: 2637.77 (r/w/o: 0.00/1897.56/740.22) lat (ms,95%): 12384.09 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 2500 tps: 654.12 qps: 2227.40 (r/w/o: 0.00/1564.28/663.12) lat (ms,95%): 12384.09 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 2499 tps: 262.01 qps: 839.02 (r/w/o: 0.00/588.01/251.01) lat (ms,95%): 13797.01 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 2499 tps: 0.00 qps: 1.00 (r/w/o: 0.00/0.00/1.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 2499 tps: 29.00 qps: 29.00 (r/w/o: 0.00/14.00/15.00) lat (ms,95%): 16519.10 err/s: 0.00 reconn/s: 0.00
[ 127s ] thds: 2486 tps: 36.00 qps: 38.00 (r/w/o: 0.00/7.00/31.00) lat (ms,95%): 20503.50 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3771670
        write:                           1077620
        other:                           538810
        total:                           5388100
    transactions:                        269405 (2119.14 per sec.)
    queries:                             5388100 (42382.84 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          127.1271s
    total number of events:              269405

Latency (ms):
         min:                                    6.89
         avg:                                 1129.82
         max:                                38487.61
         95th percentile:                     6713.97
         sum:                            304378811.87

Threads fairness:
    events (avg/stddev):           107.7620/23.93
    execution time (avg/stddev):   121.7515/1.30